class task3{
    public static void todo(){
        System.out.println("## _Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным._");
    }
    private static void core(){
        // * событие старт
    // * задаём значение на ввод
    // * задаём выводную строку
    // * задаём допустимые значения. _Ну потому что мы можем. За одно разберёмся как выглядит словарь_
    // * пока нет адекватного ввода
    //     * ввод подходит?
    // * выводим значение словаря по ключу "адекватного ввода"
    // * событие финиш
    public static void main (String[] args) {
        
    } 

    }
}