class task1{
    public static void todo(){
        System.out.println("Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.");
    }
    public static void main(String[] args){
        todo();

    }
}